# Mysql Practice Exercise

# 1. Write a query to find the third-highest salary from the EmpPosition table.

```mysql
SELECT TOP 1 salary
FROM(
SELECT TOP 3 salary
FROM employee_table
ORDER BY salary DESC) AS emp
ORDER BY salary ASC;
```

## 2.  Write a query to fetch top N records.

```mysql
SELECT * FROM EmpPosition ORDER BY Salary DESC LIMIT N;
```

## 3. Write a query to fetch the EmpFname from the EmployeeInfo table in upper case and use the ALIAS name as EmpName.
```mysql

SELECT UPPER(EmpFname) AS EmpName FROM EmployeeInfo;
```

## 4. Write a query to fetch the number of employees working in the department ‘HR’.
```mysql
SELECT COUNT(*) FROM EmployeeInfo WHERE Department = 'HR';
```

## 5. Write a query to get the current date.

```mysql
SELECT current_date();
```

## 6. Write a query to create a new table which consists of data and structure copied from the other table.

```mysql
## Using the SELECT INTO command:

1. SELECT * INTO NewTable FROM EmployeeInfo WHERE 1 = 0;
## Using the CREATE command in MySQL:

2. CREATE TABLE NewTable AS SELECT * FROM EmployeeInfo;
```

## 7. Write q query to find all the employees whose salary is between 50000 to 100000.
```mysql

SELECT * FROM EmployeePosition WHERE Salary BETWEEN '50000' AND '100000';
```

## 8. Write a query to find the names of employees that begin with ‘S’

```mysql
SELECT * FROM EmployeeInfo WHERE EmpFname LIKE 'S%';

```

## 9. Write a query to retrieve the EmpFname and EmpLname in a single column as “FullName”. The first name and the last name must be separated with space.

```mysql
SELECT CONCAT(EmpFname, ' ', EmpLname) AS 'FullName' FROM EmployeeInfo;
```

##  10. Write a query to fetch details of employees whose EmpLname ends with an alphabet ‘A’ and contains five alphabets.

```mysql
SELECT * FROM EmployeeInfo WHERE EmpLname LIKE '____a';

```

## 11. Write a query to fetch all employees who also hold the managerial position.

```mysql

SELECT E.EmpFname, E.EmpLname, P.EmpPosition 
FROM EmployeeInfo E 
INNER JOIN EmployeePosition P 
ON
E.EmpID = P.EmpID 
AND 
P.EmpPosition IN ('Manager');

```

## 12. Write a query to fetch the department-wise count of employees sorted by department’s count in ascending order.
```mysql

SELECT Department, count(EmpID) AS EmpDeptCount 
FROM EmployeeInfo GROUP BY Department 
ORDER BY EmpDeptCount ASC;
```

## 13. Write a query to calculate the even and odd records from a table.

```mysql
SELECT EmpID FROM (SELECT rowno, EmpID from EmployeeInfo) WHERE MOD(rowno,2)=0;

## odd
SELECT EmpID FROM (SELECT rowno, EmpID from EmployeeInfo) WHERE MOD(rowno,2)=1;
```

## 14. Write a query to retrieve duplicate records from a table.

```mysql
SELECT EmpID, EmpFname, Department COUNT(*) 
FROM EmployeeInfo GROUP BY EmpID, EmpFname, Department 
HAVING COUNT(*) > 1;
```

## 15. Write a query to retrieve the list of employees working in the same department.
```mysql

Select DISTINCT E.EmpID, E.EmpFname, E.Department 
FROM EmployeeInfo E, Employee E1 
WHERE E.Department = E1.Department AND E.EmpID != E1.EmpID;
```

## 16. Write a query to display the first and the last record from the EmployeeInfo table.
```mysql
SELECT * FROM EmployeeInfo WHERE EmpID = (SELECT MIN(EmpID) FROM EmployeeInfo);
```

## 17. Write a query to retrieve EmpPostion along with total salaries paid for each of them.

```mysql
SELECT EmpPosition, SUM(Salary) from EmployeePosition GROUP BY EmpPosition;
```

## 18. Write a query to fetch 50% records from the EmployeeInfo table.

```mysql
SELECT * FROM EmployeeInfo WHERE EmpID <= (SELECT COUNT(EmpID)/2 from EmployeeInfo);
```

## 19. Write a query to fetch the department-wise count of employees sorted by department’s count in ascending order.

```mysql
SELECT Department, count(EmpID) AS EmpDeptCount 
FROM EmployeeInfo GROUP BY Department 
ORDER BY EmpDeptCount ASC;
```

## 20. Write a query find number of employees whose DOB is between 02/05/1970 to 31/12/1975 and are grouped according to gender

```mysql
SELECT COUNT(*), Gender FROM EmployeeInfo WHERE DOB BETWEEN '02/05/1970 ' AND '31/12/1975' GROUP BY Gender;
```